## DNS
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.api-notification-canada-ca-A will be destroyed
  - resource "aws_route53_record" "api-notification-canada-ca-A" {
      - fqdn    = "api.notification.canada.ca" -> null
      - id      = "Z1XG153PQF3VV5_api.notification.canada.ca_CNAME" -> null
      - name    = "api.notification.canada.ca" -> null
      - records = [
          - "notification-production-alb-1685085140.ca-central-1.elb.amazonaws.com",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z1XG153PQF3VV5" -> null
    }

  # aws_route53_record.api-notification-canada-ca-A-k8s will be created
  + resource "aws_route53_record" "api-notification-canada-ca-A-k8s" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.notification.canada.ca"
      + records         = [
          + "notification-production-alb-1685085140.ca-central-1.elb.amazonaws.com",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"

      + weighted_routing_policy {
          + weight = 255
        }
    }

  # aws_route53_record.api-notification-canada-ca-A-lambda will be created
  + resource "aws_route53_record" "api-notification-canada-ca-A-lambda" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.notification.canada.ca"
      + records         = [
          + "d-3hv37fqgbg.execute-api.ca-central-1.amazonaws.com",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"

      + weighted_routing_policy {
          + weight = 0
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]

11 tests, 8 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
